const photos = [
  { src: '01.jpg', description: 'ফটো ইম্প্রেশনিজম  পদ্ধতিতে ছবি তুলতে একসময় বেশ লাগতো। জঙ্গলের মধ্যে গেলেই এই ধরণের ছবি তুলতাম। অনেক গুলো ছবি হয়েছে, কারণ আগের আড়াই বছর ফ্রানকোনিয়ার জঙ্গলে কাটিয়েছি। সেই এলবামের নাম দিয়েছি Monets forest। ওশ্লো এসেই আবার জঙ্গলে বেরিয়ে পড়লাম এক সপ্তাহন্তে। সাত জন যাচ্ছি একসাথে। ফটো ইম্প্রেশনিজম পদ্ধতিতে ছবি তুলতে একসময় বেশ লাগতো। জঙ্গলের মধ্যে গেলেই এই ধরণের ছবি তুলতাম। অনেক গুলো ছবি হয়েছে, কারণ আগের আড়াই বছর ফ্রানকোনিয়ার জঙ্গলে কাটিয়েছি। সেই এলবামের নাম দিয়েছি Monets forest । ওশ্লো এসেই আবার জঙ্গলে বেরিয়ে পড়লাম এক সপ্তাহন্তে। সাত জন যাচ্ছি একসাথে। সাত জন বিভিন্ন দেশের মানুষ - ডাচ, হাঙ্গেরিয়ান, রুশ, ক্রোয়েট, চৈনিক এবং দুজন ভারতীয়। কিন্তু সবাই একই ডিপার্টমেন্টে কাজ করি। সবাই মাটি পাথর নিয়ে পড়াশুনো করেছি। সবাই জঙ্গলের খোঁজে চলেছি। ওশ্লো শহরের মধ্যেই জঙ্গল। সবুজ জঙ্গলের মধ্যে ছোট্ট নীল হ্রদ, লাল কেবিন।  আর পথে অসংখ্য মাশরুম, ব্লু বেড়ি, রাস্পবেরির জঙ্গল। সেসবের খোঁজেই ব্যাগ কাঁধে করে বেরিয়ে পড়া। জঙ্গলের গল্পের প্রথম ছবি হিসাবে থাকলো সেই মনের জঙ্গলের ইম্প্রেশন । ' },

  { src: '02.jpg', description: 'বাড়ির সামনেই মেট্রো স্টেশন। একটা মেট্রো পরিবর্তন করে ১ নং মেট্রো ধরে যাচ্ছি একদম শেষের স্টেশনে। নাম ফ্রগনেসটেরেন। শহর থেকে একটু উঁচুতে জায়গাটা। ক্রমশ উঠতে থাকি, ফিয়র্ড দেখা যায় পাহাড়ের ওপর থেকে, আর নরওয়েজিয়ান বাড়ি ঘর। ' },

  { src: '03.jpg', description: 'ফ্রগনেসটেরেন স্টেশন থেকে নামলেই জঙ্গলের রাস্তা। আমাদের যাত্রা শুরু। ' },

  { src: '04.jpg', description: 'জঙ্গল কখনো ঘন হয়, কখনো পাতলা। আকাশের অবস্থা বোঝা দায়। একটু আগে ঝকঝকে রোদ ছিল, এখনই এক পশলা বৃষ্টি হয়ে গেলো। পায়ের নিচের রাস্তা ভেজা। তারই মধ্যে হেঁটে চলছে আরো অনেকে। দূর থেকে তাদের পায়ের শব্দ শোনা যায়। ' },

  { src: '05.jpg', description: 'জঙ্গল পেরিয়ে আমাদের একদিনের লাল রঙের বাড়ি। নীল আকাশের ভিতর থেকে দেখা যায়। ' },

  { src: '06.jpg', description: 'ঘরে ব্যাগ পত্র রাখা হলো। সবাই যে যার জায়গা বেছে নিলো। তবে সাত জনের মধ্যে চার জন  জল ঘরে থাকবে, দুজন থাকবে দোলনায়, একজন তাঁবুতে। ঘরের বাইরে তাই বসে আছে আগি (নাম : আগ্নেস কিরালী, হাঙ্গেরিয়ান), ও গাছের ডালে দোলনা বেঁধে থাকবে। সাথে আছে মিং। যদিও মিং ঘরে থাকবে। ' },

  { src: '07.jpg', description: 'আমাদের কেবিনের থেকে একটু ওপরের দিকে উঠে গেলেই আবার জঙ্গল। অসংখ্য বার্চ, পাইনের গাছে ভর্তি। তাদের লম্বা লম্বা পা। দুটো বার্চ গাছের মধ্যে জায়গা পেয়ে আগি আর সাশা (নাম: আলেক্সান্ডার মিনাকভ, রুশ) দোলনা টাঙাতে শুরু করেছে। এটা আগির ঘর, আজকের জন্য। ' },

  { src: '08.jpg', description: 'জঙ্গল থেকে নেমে এলেই আবার কেবিন। দরজার সামনে বসে পরবর্তী পরিকল্পনা করছে আনিক (নাম: আনিক ভ্যান দার বুন, ডাচ)। পাশে বসে দ্বিতীয় ভারতীয়, জগন্ময়।  ' },

  { src: '09.jpg', description: 'আমি বেশি কিছুবার যাতায়াত করছি, ওপর নিচে। ওপর থেকেই দৃশ্যটা সুন্দর। এই কেবিনে থাকার থেকেও দূর থেকে কেবিনটা দেখতে ভারী ভালো লাগে। গাছগাছালির ফাঁক দিয়ে, দেখা যায় সেই লাল বাড়ি। বাড়ির সামনে বসে স্লিপিং ম্যাটে হাওয়া ভরছে আনা (নাম: আনা আন্জুলোভিচ, ক্রোয়েট)। ও থাকবে তাঁবুতে। তার তোড়জোড় চলছে।  ' },

  { src: '10.jpg', description: 'সাশার দোলনা টাঙানো হয়ে গেছে। সবাইকে সাহায্য করে ছেলেটা। এখন দুলছে, আর বিশ্রাম নিচ্ছে। ' },

  { src: '11.jpg', description: 'দোলনা ছেড়ে কেবিনের দিকে যাচ্ছে সাশা। ' },

  { src: '12.jpg', description: 'দোলনা ফাঁকা পেয়ে আমি একটু চড়ে বসলাম। ভয় হচ্ছিলো, আমার এই বিশাল শরীরের ওজন নিতে পারবে কিনা। সাশা বললো দুশো কেজি পর্যন্ত নিতে পারবে। তাই একটু নিশ্চিন্তে বসলাম দোল খেতে। নিচের কেবিন দেখা যায়। তারও নিচে ছোট একটা জলাশয়। ওখান থেকেই আমাদের খাবার জল আসবে।' },


  { src: '13.jpg', description: 'এক পশলা বিশ্রাম পর্ব শেষ করে আবার একটু ঘুরতে বেরোনো হলো বিকেলের দিকে। জঙ্গলের চড়াই ভেঙে এলাম কোন এক নাম না জানা ভিউ পয়েন্টে। ছবি তোলার মতো বিশেষ কোনো ভিউ নেই। কিন্তু হয়তো সবাই ওই পাথুরে ঢিবিটাকেই সামিট মনে করেছে। ' },


  { src: '14.jpg', description: 'এই চড়াই রাস্তার শেষে একটা রেস্তোরাঁ। কেক, পাউরুটি পাওয়া যায়। দারুচিনির পাউরুটি আমার বরাবরই পছন্দের। এখানে সিনামন ব্রেড বলে, তবে সেরা সিনামন ব্রেড খেয়েছিলাম হেলসিংকিতে। ওখানে বলে কর্ভা প্লুস্তি। সে অদ্ভুদ ফিনিশ নাম। ব্রেড আর বিয়ার খেয়ে রেস্তোরাঁর রেলিঙের ধরে বসে সবাই। অনেক নিচে, আমাদের লাল কেবিন আছে। ছবিতে দেখা যাচ্ছে না। লাল বেরির গাছ ঢেকে দিয়েছে সেই দৃশ্য।  ' },
  { src: '15.jpg', description: 'সন্ধে হতে এখনো দেরি আছে। মাত্র সাতটা  বাজে। কিন্তু রাতের খাবারের প্রস্তুতি শুরু। একদল বুড়িতো বানাচ্ছে রান্না ঘরে। একদল উঠোনে বার্বি কিউ করছে আলু, বেগুন, মাশরুম, ক্যাপসিকাম। মিলিয়ে মিশিয়ে খাওয়া হবে! ' },

  { src: '16.jpg', description: 'ডিনার শুরু। যদিও বার্বিকিউ এখনো চলছে। ওতে সময় লাগবে, আরো কিছুক্ষন গরম করতে হবে খাবার। এক দুই রাউন্ডে রাউন্ডে খাবার আসতে থাকবে। ' },
 
 { src: '17.jpg', description: 'সাড়ে নয়টা নাগাদ সূর্য অস্ত গেলো। অস্তমিত সূর্যের সোনালী আলো এসে পড়েছে পাহাড়ি জঙ্গলের মাথায়। এ বহু পুরোনো দৃশ্য। তাও পুরোনো হয় না। ' },
  
{ src: '18.jpg', description: 'সূর্যাস্তের ছায়া পড়েছে জলাশয়ে। এর পর নিস্তব্ধতা গ্রাস করবে আরো। অদ্ভুদ ব্যাপার, এ জঙ্গলে কোনো পাখির ডাকও শোনা গেলো না। চারিদিকে এতো ফল, কিন্তু পাখি নেই কেন?' },
  { src: '19.jpg', description: 'পরের দিন সকাল এগারোটার মধ্যে কেবিন ছেড়ে বেরিয়ে পড়লাম শহরের উদ্দেশ্যে। আবার পাহাড় জঙ্গলের পথ। শহর আর জঙ্গলের মাঝে আছে রেস্তোরাঁ। যেন ইউরোপের সরাই খানা। সামান্য জিরিয়ে নেবার জন্য জঙ্গলের মাঝে এক হোটেল। জায়গাটার নাম উল্লেভাল সেটার।  আজ রোদ্দুর বেরিয়েছে, সাথে রবিবার। সমস্ত শহর জঙ্গলে ভিড় করেছে। রেস্তোরাঁয় বিস্তর ভিড়। ' },

  { src: '20.jpg', description: 'জঙ্গল দিয়ে শুরু, জঙ্গলেই শেষ। এই পথ শেষ হবে ওশ্লোর প্রান্তে, হ্যামারেনে। সেখান থেকে বাস ধরে, মেট্রো ধরে বাড়ি। আর অল্প সময়ের মধ্যে সেই পথও শেষ হয়ে যাবে... ' },

];


let currentPhotoIndex = 0;

document.getElementById('next-button').addEventListener('click', () => {
  switchPhoto(1);
});

document.getElementById('prev-button').addEventListener('click', () => {
  switchPhoto(-1);
});

function switchPhoto(direction) {
  currentPhotoIndex = (currentPhotoIndex + direction + photos.length) % photos.length;
  updatePhotoAndDescription();
}

// Initialize with the first photo
updatePhotoAndDescription();

function updatePhotoAndDescription() {
  const photoElement = document.getElementById('photo');
  const descriptionElement = document.getElementById('photo-description');
  const slideNumberElement = document.getElementById('slide-number');

  photoElement.src = photos[currentPhotoIndex].src;
  descriptionElement.textContent = photos[currentPhotoIndex].description;
  slideNumberElement.textContent = `${currentPhotoIndex + 1}/${photos.length}`;
}